<?php
namespace LapayGroup\RussianPost;

use LapayGroup\RussianPost\Exceptions\StatusValidationException;

//Список статусов Почты России
class StatusList
{
    //Карта сопоставления статусов по кодам статуса и подстатуса
    private $statusMap = [
        '1' => [ //Прием
            '1' => 'Единичный',
            '2' => 'Партионный',
            '3' => 'Партионный электронно'
        ],
        '2' => [ //Вручение
            '0' => '',
            '1' => 'Вручение адресату', //Конечный
            '2' => 'Вручение отправителю', //Конечный
            '3' => 'Выдано адресату через почтомат', //Конечный
            '4' => 'Выдано отправителю через почтомат', //Конечный
            '5' => 'Адресату электронно', //Конечный
            '6' => 'Адресату почтальоном', //Конечный
            '7' => 'Отправителю почтальоном', //Конечный
            '8' => 'Адресату курьером', //Конечный
            '9' => 'Отправителю курьером', //Конечный
            '10' => 'Адресату с контролем ответа', //Конечный
            '11' => 'Адресату с контролем ответа почтальоном', //Конечный
            '12' => 'Адресату с контролем ответа курьером' //Конечный
        ],
        '3' => [ //Возврат
            '1' => 'Истёк срок хранения',
            '2' => 'Заявление отправителя',
            '3' => 'Отсутствие адресата по указанному адресу',
            '4' => 'Отказ адресата',
            '5' => 'Смерть адресата',
            '6' => 'Невозможно прочесть адрес адресата',
            '7' => 'Отказ в выпуске таможней',
            '8' => 'Адресат, абонирующий абонементный почтовый шкаф, не указан или указан неправильно',
            '9' => 'Иные обстоятельства',
            '10' => 'Неверный адрес',
            '11' => 'Несоответствие комплектности',
            '12' => 'Запрещено САБ'
        ],
        '4' => [ //Досылка почты
            '1' => 'По заявлению пользователя',
            '2' => 'Выбытие адресата по новому адресу',
            '3' => 'Засылка',
            '4' => 'Запрещено САБ',
            '5' => 'Передача на временное хранение',
            '6' => 'Передача в невостребованные'
        ],
        '5' => [ //Невручение
            '1' => 'Утрачено', //Конечный
            '2' => 'Изъято', //Конечный
            '3' => 'Засылка',
            '8' => 'Решение таможни',
            '9' => 'Доставка по указанному адресу не осуществляется'
        ],
        '6' => [ //Хранение
            '1' => 'До востребования',
            '2' => 'На абонементный ящик',
            '3' => 'Установленный срок хранения',
            '4' => 'Продление срока хранения по заявлению адресата',
            '5' => 'Продление срока выпуска таможней'
        ],
        '7' => [ //Временное хранение
            '1' => 'Нероздано',
            '2' => 'Невостребовано',
            '3' => 'Содержимое запрещено к пересылке',
            '4' => 'Ожидает результаты экспертизы'
        ],
        '8' => [ //Обработка
            '0' => 'Сортировка',
            '1' => 'Покинуло место приёма',
            '2' => 'Прибыло в место вручения',
            '3' => 'Прибыло в сортировочный центр',
            '4' => 'Покинуло сортировочный центр',
            '5' => 'Прибыло в место международного обмена',
            '6' => 'Покинуло место международного обмена',
            '7' => 'Прибыло в место транзита',
            '8' => 'Покинуло место транзита',
            '9' => 'Прибыло в почтомат',
            '10' => 'Истекает срок хранения в почтомате',
            '11' => 'Переадресовано в почтомат',
            '12' => 'Изъято из почтомата',
            '13' => 'Прибыло на территорию РФ',
            '14' => 'Прибыло в Центр выдачи посылок',
            '15' => 'Передано курьеру',
            '16' => 'Доставлено для вручения электронно',
            '17' => 'Прибыло в ЦГП',
            '18' => 'Передано почтальону',
            '19' => 'Передача в кладовую хранения',
            '20' => 'Покинуло место возврата/досылки',
            '21' => 'Уточнение адреса',
            '22' => 'Ожидает курьерской доставки',
            '23' => 'Продление срока хранения',
            '24' => 'Направлено извещение',
            '25' => 'Доставлено извещение',
            '26' => 'Зарегистрировано с новым номером',
            '27' => 'Истекает срок хранения (осталось 25 дней)',
            '28' => 'Истекает срок хранения (осталось 5 дней)',
            '29' => 'Находится на техническом исследовании',
            '30' => 'Поступило в ЦГП',
            '31' => 'Покинуло ЦГП'
        ],
        '9' => [ // Импорт международной почты (БЕЗ АТРИБУТА)
            '0' => 'Импорт международной почты'
        ],
        '10' => [ //Экспорт международной почты (БЕЗ АТРИБУТА)
            '0' => 'Экспорт международной почты'
        ],
        '11' => [ //Прием на таможню (БЕЗ АТРИБУТА)
            '0' => 'Прием на таможню'
        ],
        '12' => [ //Неудачная попытка вручения
            '1' => 'Временное отсутствие адресата',
            '2' => 'Доставка отложена по просьбе адресата',
            '3' => 'Неполный адрес',
            '4' => 'Неправильный адрес',
            '5' => 'Адресат выбыл',
            '6' => 'Отказ от получения',
            '7' => 'Обстоятельства непреодолимой силы',
            '8' => 'Иная',
            '9' => 'Адресат заберет отправление сам',
            '10' => 'Нет адресата',
            '11' => 'По техническим причинам',
            '12' => 'Истек срок хранения в почтомате',
            '13' => 'По требованию отправителя',
            '14' => 'Отправление повреждено и/или без вложения',
            '15' => 'В ожидании оплаты сбора',
            '16' => 'Адресат переехал',
            '17' => 'У адресата есть абонентский ящик',
            '18' => 'Нет доставки на дом',
            '19' => 'Не отвечает таможенным требованиям',
            '20' => 'Неполные/недостаточные/неверные документы',
            '21' => 'Невозможно связаться с клиентом',
            '22' => 'Адресат бастует',
            '23' => 'Запрещенные вложения – отправление не доставлено',
            '24' => 'Отказ в импорте – запрещенные вложения',
            '25' => 'Засыл отправления',
            '26' => 'За смертью получателя',
            '27' => 'Национальный праздник',
            '28' => 'Утрата'
        ],
        '13' => [ //Регистрация отправки (БЕЗ АТРИБУТА)
            '0' => 'Регистрация отправки'
        ],
        '14' => [ //Таможенное оформление
            '1' => 'Выпущено таможней',
            '2' => 'Возвращено таможней',
            '3' => 'Осмотрено таможней',
            '4' => 'Отказ в выпуске',
            '5' => 'Направлено с таможенным уведомлением',
            '6' => 'Направлено с обязательной уплатой таможенных платежей',
            '7' => 'Требуется досмотр',
            '8' => 'Выпуск приостановлен',
            '9' => 'Отказ в приеме на таможню',
            '10' => 'Проведен осмотр с использованием ТСТК',
            '11' => 'ТК в рамках СУР*',
            '12' => 'Досмотр завершен',
            '13' => 'Выпуск разрешен. Таможенные платежи уплачены',
            '14' => 'Отказ в выпуске. Таможенные платежи не уплачены'
        ],
        '15' => [ //Передача на временное хранение (БЕЗ АТРИБУТА) (КОНЕЧНЫЙ)
            '0' => 'Передача на временное хранение',
        ],
        '16' => [ //Уничтожение (БЕЗ АТРИБУТА) (КОНЕЧНЫЙ)
            '0' => 'Уничтожение',
        ],
        '17' => [ //Передача вложения на баланс (БЕЗ АТРИБУТА) (КОНЕЧНЫЙ)
            '0' => 'Передача вложения на баланс',
        ],
        '18' => [ //Регистрация утраты (БЕЗ АТРИБУТА) (КОНЕЧНЫЙ)
            '0' => 'Регистрация утраты',
        ],
        '19' => [ //Таможенные платежи поступили (БЕЗ АТРИБУТА)
            '0' => 'Таможенные платежи поступили',
        ],
        '20' => [ //Регистрация (БЕЗ АТРИБУТА)
            '0' => 'Регистрация',
        ],
        '21' => [ //Доставка
            '1' => 'Доставлено в почтовый ящик',
            '2' => 'Доставлено в руки адресату под роспись',
            '3' => 'Доставлено на ресепшн или секретариат под роспись'
        ],
        '22' => [ //Недоставка
            '1' => 'Отсутствие п/я',
            '2' => 'Отсутствие улицы, дома, квартиры',
            '3' => 'Несоответствие индекса ОПС выдачи',
            '4' => 'Неверный адрес/адрес не существует',
            '5' => 'Отказ в получении',
            '6' => 'Нет доступа по адресу',
            '7' => 'Организация сменила адрес',
            '8' => 'Адресат выбыл',
            '9' => 'Отправление не поместилось в п/я'
        ],
        '23' => [ //Поступление на временное хранение
            '0' => 'Поступление на временное хранение'
        ],
        //TODO дополнить статусами 1019 - 1099
        '24' => [ //Продление срока выпуска таможней
            '1' => 'Запрещенные вложения',
            '2' => 'Импортируемые вложения являются предметом ограничений - Несоответствующая/отсутствующая лицензия',
            '3' => 'Несоответствующий/отсутствующий сертификат о происхождении груза',
            '4' => 'Несоответствующая/отсутствующая таможенная декларация',
            '5' => 'Контакт с клиентом для запроса информации невозможен',
            '6' => 'Некомплектная поставка',
            '7' => 'Передано в таможенный орган',
            '8' => 'Экспортируемые вложения являются предметом ограничений - Несоответствующая/отсутствующая лицензия',
            '9' => 'Неполная/некорректная документация, ожидается дополнительная документация'
        ],
        '25' => [ //Вскрытие (БЕЗ АТРИБУТА)
            '0' => 'Вскрытие'
        ],
        '26' => [ //Отмена
            '1' => 'Требование отправителя',
            '2' => 'Ошибка оператора'
        ],
        '27' => [ // Получена электронная регистрация (БЕЗ АТРИБУТА)
            '0' => 'Получена электронная регистрация'
        ],
        '28' => [ // Присвоение идентификатора (БЕЗ АТРИБУТА)
            '0' => 'Присвоение идентификатора'
        ],
        '29' => [ // Регистрация прохождения в ММПО (БЕЗ АТРИБУТА)
            '0' => 'Регистрация прохождения в ММПО'
        ],
        '30' => [ // Отправка SRM (БЕЗ АТРИБУТА)
            '0' => 'Отправка SRM'
        ],
        '31' => [ //Обработка перевозчиком
            '21' => 'Доставлено перевозчиком в страну назначения',
            '40' => 'Прибыло на склад перевозчика'
        ],
        '32' => [ // Поступление АПО (БЕЗ АТРИБУТА)
            '0' => 'Поступление АПО'
        ],
        '33' => [ // Международная обработка (БЕЗ АТРИБУТА)
            '0' => 'Международная обработка'
        ]
    ];

    private $statusNameList = [
                                1 => 'Прием',
                                2 => 'Вручение',
                                3 => 'Возврат',
                                4 => 'Досылка почты',
                                5 => 'Невручение',
                                6 => 'Хранение',
                                7 => 'Временное хранение',
                                8 => 'Обработка',
                                9 => 'Импорт международной почты',
                                10 => 'Экспорт международной почты',
                                11 => 'Прием на таможню',
                                12 => 'Неудачная попытка вручения',
                                13 => 'Регистрация отправки',
                                14 => 'Таможенное оформление',
                                15 => 'Передача на временное хранение',
                                16 => 'Уничтожение',
                                17 => 'Оформление в собственность',
                                18 => 'Регистрация утраты',
                                19 => 'Таможенные платежи поступили',
                                20 => 'Регистрация',
                                21 => 'Доставка',
                                22 => 'Недоставка',
                                23 => 'Поступление на временное хранение',
                                24 => 'Продление срока выпуска таможней',
                                25 => 'Вскрытие',
                                26 => 'Отмена',
                                27 => 'Получена электронная регистрация',
                                28 => 'Присвоение идентификатора',
                                29 => 'Регистрация прохождения в ММПО',
                                30 => 'Отправка SRM',
                                31 => 'Обработка перевозчиком',
                                32 => 'Поступление АПО',
                                33 => 'Международная обработка'
                            ];

    /**
     * Возвращает массив конечных статусов
     * @return array
     */
    public function getFinalList()
    {
        return [
            2 => [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
            5 => [1, 2],
            15 => [0],
            16 => [0],
            17 => [0],
            18 => [0]
        ];
    }

    /**
     * Функция по коду статуса или статуса и подстатуса возвращает информацию по статусу
     * @param $statusId код статуса
     * @param $substatusId код подстатуса (Если не передан, то вернет информацию только по статусу)
     * @param string $statusName название статуса (Если не передан, то возьмет название из справочника)
     * @return array
     */
    public function getInfo($statusId, $substatusId=false, $statusName = false)
    {
        //Проверяем, что передан существующий код статуса
        if (empty($this->statusMap[$statusId])) {
            throw new StatusValidationException('Неверный код статуса', 404);
        }

        //Проверяем, что передан существующий код подстатуса
        if (isset($substatusId) && empty($this->statusMap[$statusId][$substatusId])) {
            throw new StatusValidationException('Неверный код подстатуса', 405);
        }

        if (empty($statusName))
            $statusName = !empty($this->statusNameList[$statusId]) ? $this->statusNameList[$statusId] : 'Не определено';

        $result['statusName'] = $statusName;
        $result['statusId'] = $statusId;

        if (isset($substatusId)) {
            $result['substatusId'] = $substatusId;
            if(!empty($this->statusMap[$statusId][$substatusId])) {
                $result['substatusName'] = $this->statusMap[$statusId][$substatusId];
            } elseif (!empty($this->statusMap[$statusId][0])) {
                $result['substatusName'] = $this->statusMap[$statusId][0];
            } else {
                $result['substatusName'] = 'Не определено';
            }
        }

        return $result;
    }
}